Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.media_cf_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "media_cf_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
            ]
          + sid       = "AllowCloudFrontOACRead"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_apigatewayv2_api.http will be updated in-place
~ resource "aws_apigatewayv2_api" "http" {
        id                           = "go2gft4394"
        name                         = "wrestleutopia-api"
        tags                         = {}
        # (12 unchanged attributes hidden)

      ~ cors_configuration {
          ~ allow_headers     = [
              - "accept",
              - "authorization",
              - "content-type",
              - "origin",
              - "x-amz-date",
              - "x-amz-security-token",
              - "x-amz-user-agent",
              - "x-requested-with",
              + "Authorization",
              + "Content-Type",
            ]
            # (5 unchanged attributes hidden)
        }
    }

  # aws_apigatewayv2_route.get_promoter_tryouts will be created
+ resource "aws_apigatewayv2_route" "get_promoter_tryouts" {
      + api_id             = "go2gft4394"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + region             = "us-east-2"
      + route_key          = "GET /profiles/promoters/{userId}/tryouts"
      + target             = "integrations/dyfsv68"
    }

  # aws_cloudfront_distribution.media will be updated in-place
~ resource "aws_cloudfront_distribution" "media" {
        id                              = "E38TFLPKVTD078"
        tags                            = {}
        # (24 unchanged attributes hidden)

      - origin {
          - connection_attempts         = 3 -> null
          - connection_timeout          = 10 -> null
          - domain_name                 = "prod-wrestleutopia-media-bucket.s3.us-east-2.amazonaws.com" -> null
          - origin_access_control_id    = "E13MPCJ2G0S1JT" -> null
          - origin_id                   = "media-s3-origin" -> null
          - response_completion_timeout = 0 -> null
            # (1 unchanged attribute hidden)
        }
      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = "prod-wrestleutopia-media-bucket.s3.us-east-2.amazonaws.com"
          + origin_access_control_id    = "E13MPCJ2G0S1JT"
          + origin_id                   = "media-s3-origin"
          + response_completion_timeout = (known after apply)
            # (1 unchanged attribute hidden)

          + s3_origin_config {
                # (1 unchanged attribute hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.media_cf will be updated in-place
~ resource "aws_s3_bucket_policy" "media_cf" {
        id     = "prod-wrestleutopia-media-bucket"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::prod-wrestleutopia-media-bucket/*"
                      - Sid       = "AllowCloudFrontOACRead"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 1 to add, 3 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```